Do these exercises in a notebook called `modeling.ipynb` first, then transfer the final functions to the `model.py` file.
- [x] modeling.ipynb
- [ ] model.py

In [2]:
# import python libraries
import pandas as pd
import numpy as np

# import personal libraries
import acquire
import prepare

Using the Titanic dataset

1. [x] Use the function defined in `acquire.py` to load the Titanic data.

In [4]:
titanic = acquire.get_titanic_data()
titanic.head()

Reading from file...

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [5]:
acquire.df_info(titanic)

              nunique   dtypes  isnull       sample
passenger_id      891    int64       0          494
survived            2    int64       0            0
pclass              3    int64       0            3
sex                 2   object       0         male
age                88  float64     177         21.0
sibsp               7    int64       0            0
parch               7    int64       0            0
fare              248  float64       0         8.05
embarked            3   object       2            S
class               3   object       0        Third
deck                7   object     688          NaN
embark_town         3   object       2  Southampton
alone               2    int64       0            1

2. [x] Use the function defined in `prepare.py` to prepare the titanic data.

In [7]:
titanic = prepare.prep_titanic(titanic)
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,Southampton,1

In [8]:
acquire.df_info(titanic)

              nunique   dtypes  isnull       sample
passenger_id      891   object       0          705
survived            2   object       0            0
pclass              3   object       0            2
sex                 2   object       0         male
age                88  float64     177         39.0
sibsp               7   object       0            0
parch               7   object       0            0
fare              248  float64       0         26.0
embark_town         3   object       2  Southampton
alone               2   object       0            1

In [9]:
train,validate,test = prepare.split_df(titanic,'survived')
acquire.df_info(train)

              nunique   dtypes  isnull       sample
passenger_id      534   object       0          206
survived            2   object       0            0
pclass              3   object       0            3
sex                 2   object       0         male
age                76  float64     105         32.0
sibsp               7   object       0            1
parch               6   object       0            0
fare              194  float64       0        15.85
embark_town         3   object       1  Southampton
alone               2   object       0            0

3. [X] Encode the categorical columns on train dataset. Create dummy variables of the categorical columns and concatenate them onto the dataframe. Remove the columns they are replacing. Repeat on validate and test.

In [11]:
# split sex and append it to train
train['is_male'] = pd.get_dummies(train.sex,drop_first=True).astype(int)
train

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embark_town,alone,is_male
776,776,0,3,male,NaN,0,0,7.7500,Queenstown,1,1
829,829,1,1,female,62.0,0,0,80.0000,NaN,1,0
215,215,1,1,female,31.0,1,0,113.2750,Cherbourg,0,0
258,258,1,1,female,35.0,0,0,512.3292,Cherbourg,1,0
129,129,0,3,male,45.0,0,0,6.9750,Southampton,1,1
...,...,...,...,...,...,...,...,...,...,...,...
125,125,1,3,male,12.0,1,0,11.2417,Cherbourg,0,1
360,360,0,3,male,40.0,1,4,27.9000,Southampton,0,1
55,55,1,1,male,NaN,0,0,35.5000,Southampton,1,1
298,298,1,1,male,NaN,0,0,30.5000,Southampton,1,1
768,768,0,3,male,NaN,1,0,24.1500,Queenstown,0,1

In [12]:
# split embark_town and append it to train
train[['is_Queenstown','is_Southampton']] = pd.get_dummies(train.embark_town,drop_first=True).astype(int)
train

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embark_town,alone,is_male,is_Queenstown,is_Southampton
776,776,0,3,male,NaN,0,0,7.7500,Queenstown,1,1,1,0
829,829,1,1,female,62.0,0,0,80.0000,NaN,1,0,0,0
215,215,1,1,female,31.0,1,0,113.2750,Cherbourg,0,0,0,0
258,258,1,1,female,35.0,0,0,512.3292,Cherbourg,1,0,0,0
129,129,0,3,male,45.0,0,0,6.9750,Southampton,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
125,125,1,3,male,12.0,1,0,11.2417,Cherbourg,0,1,0,0
360,360,0,3,male,40.0,1,4,27.9000,Southampton,0,1,0,1
55,55,1,1,male,NaN,0,0,35.5000,Southampton,1,1,0,1
298,298,1,1,male,NaN,0,0,30.5000,Southampton,1,1,0,1
768,768,0,3,male,NaN,1,0,24.1500,Queenstown,0,1,1,0

In [13]:
# drop sex and embark_town
train = train.drop(columns=['sex','embark_town'],errors='ignore')

train

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone,is_male,is_Queenstown,is_Southampton
776,776,0,3,NaN,0,0,7.7500,1,1,1,0
829,829,1,1,62.0,0,0,80.0000,1,0,0,0
215,215,1,1,31.0,1,0,113.2750,0,0,0,0
258,258,1,1,35.0,0,0,512.3292,1,0,0,0
129,129,0,3,45.0,0,0,6.9750,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...
125,125,1,3,12.0,1,0,11.2417,0,1,0,0
360,360,0,3,40.0,1,4,27.9000,0,1,0,1
55,55,1,1,NaN,0,0,35.5000,1,1,0,1
298,298,1,1,NaN,0,0,30.5000,1,1,0,1
768,768,0,3,NaN,1,0,24.1500,0,1,1,0

In [14]:
# Reevaluate dataset
acquire.df_info(train)

                nunique   dtypes  isnull  sample
passenger_id        534   object       0     721
survived              2   object       0       0
pclass                3   object       0       3
age                  76  float64     105    17.0
sibsp                 7   object       0       1
parch                 6   object       0       0
fare                194  float64       0  7.0542
alone                 2   object       0       0
is_male               2    int64       0       1
is_Queenstown         2    int64       0       0
is_Southampton        2    int64       0       1

In [15]:
# age still has nulls
# Examine age to determine what to do with it
print(f'age mode: {train.age.mode()}')
print(f'age mean: {train.age.mean()}')
print(f'age range: {train.age.max()-train.age.min()}')

age mode: 0    19.0
Name: age, dtype: float64
age mean: 28.622773892773893
age range: 70.58

In [16]:
# it's strange that age range is a float
train.age.nsmallest(10)

803    0.42
644    0.75
469    0.75
831    0.83
305    0.92
164    1.00
386    1.00
827    1.00
172    1.00
183    1.00
Name: age, dtype: float64

In [17]:
# get proportions of nulls in age to total
train.age.isna().mean()

0.19662921348314608

In [18]:
# See how age correlates with other columns
train.corr()['age']

passenger_id      0.009966
survived         -0.080203
pclass           -0.381316
age               1.000000
sibsp            -0.333471
parch            -0.166234
fare              0.097977
alone             0.192770
is_male           0.034655
is_Queenstown    -0.045625
is_Southampton   -0.023125
Name: age, dtype: float64

In [19]:
# pclass has the highest correlation with age
# Compare binned ages against pclasses using crosstab
pd.crosstab(pd.cut(train.age,bins=5),train.pclass,dropna=False,normalize=True)*100

pclass                   1         2          3
age
NaN               3.558052  0.936330  15.168539
(0.349, 14.536]   0.374532  2.434457   7.116105
(14.536, 28.652]  4.868914  8.426966  21.535581
(28.652, 42.768]  6.367041  5.992509   9.550562
(42.768, 56.884]  5.056180  2.434457   2.808989
(56.884, 71.0]    2.247191  0.374532   0.749064

In [20]:
# apply function to get mean of a passengers age grouped by pclass
train.age = train.age.fillna(round(train.groupby('pclass').age.transform('mean'),2))
train

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone,is_male,is_Queenstown,is_Southampton
776,776,0,3,24.31,0,0,7.7500,1,1,1,0
829,829,1,1,62.00,0,0,80.0000,1,0,0,0
215,215,1,1,31.00,1,0,113.2750,0,0,0,0
258,258,1,1,35.00,0,0,512.3292,1,0,0,0
129,129,0,3,45.00,0,0,6.9750,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...
125,125,1,3,12.00,1,0,11.2417,0,1,0,0
360,360,0,3,40.00,1,4,27.9000,0,1,0,1
55,55,1,1,38.27,0,0,35.5000,1,1,0,1
298,298,1,1,38.27,0,0,30.5000,1,1,0,1
768,768,0,3,24.31,1,0,24.1500,0,1,1,0

In [21]:
# Revisit how the dataset looks
acquire.df_info(train)

                nunique   dtypes  isnull   sample
passenger_id        534   object       0      509
survived              2   object       0        1
pclass                3   object       0        3
age                  79  float64       0     26.0
sibsp                 7   object       0        0
parch                 6   object       0        0
fare                194  float64       0  56.4958
alone                 2   object       0        1
is_male               2    int64       0        1
is_Queenstown         2    int64       0        0
is_Southampton        2    int64       0        1

In [22]:
# Now do this all to validate
validate['is_male'] = pd.get_dummies(validate.sex,drop_first=True).astype(int)
validate[['is_Queenstown','is_Southampton']] = pd.get_dummies(validate.embark_town,drop_first=True).astype(int)
validate = validate.drop(columns=['sex','embark_town'],errors='ignore')
validate.age = validate.age.fillna(round(validate.groupby('pclass').age.transform('mean'),2))

# Check without looking at all the data
acquire.df_info(validate)

                nunique   dtypes  isnull    sample
passenger_id        178   object       0       268
survived              2   object       0         1
pclass                3   object       0         1
age                  61  float64       0      58.0
sibsp                 6   object       0         0
parch                 4   object       0         1
fare                112  float64       0  153.4625
alone                 2   object       0         0
is_male               2    int64       0         0
is_Queenstown         2    int64       0         0
is_Southampton        2    int64       0         1

In [49]:
# Repeat with test
test['is_male'] = pd.get_dummies(test.sex,drop_first=True).astype(int)
test[['is_Queenstown','is_Southampton']] = pd.get_dummies(test.embark_town,drop_first=True).astype(int)
test = test.drop(columns=['sex','embark_town'],errors='ignore')
test.age = test.age.fillna(round(test.groupby('pclass').age.transform('mean'),2))

# Check without looking at all the data
acquire.df_info(validate)

                nunique   dtypes  isnull  sample
passenger_id        178   object       0     367
survived              2   object       0       1
pclass                3   object       0       3
age                  61  float64       0   26.91
sibsp                 6   object       0       0
parch                 4   object       0       0
fare                112  float64       0  7.2292
alone                 2   object       0       1
is_male               2    int64       0       0
is_Queenstown         2    int64       0       0
is_Southampton        2    int64       0       0

In [55]:
# Try to turn everything into a float
train.astype(float)

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone,is_male,is_Queenstown,is_Southampton
776,776.0,0.0,3.0,24.31,0.0,0.0,7.7500,1.0,1.0,1.0,0.0
829,829.0,1.0,1.0,62.00,0.0,0.0,80.0000,1.0,0.0,0.0,0.0
215,215.0,1.0,1.0,31.00,1.0,0.0,113.2750,0.0,0.0,0.0,0.0
258,258.0,1.0,1.0,35.00,0.0,0.0,512.3292,1.0,0.0,0.0,0.0
129,129.0,0.0,3.0,45.00,0.0,0.0,6.9750,1.0,1.0,0.0,1.0
...,...,...,...,...,...,...,...,...,...,...,...
125,125.0,1.0,3.0,12.00,1.0,0.0,11.2417,0.0,1.0,0.0,0.0
360,360.0,0.0,3.0,40.00,1.0,4.0,27.9000,0.0,1.0,0.0,1.0
55,55.0,1.0,1.0,38.27,0.0,0.0,35.5000,1.0,1.0,0.0,1.0
298,298.0,1.0,1.0,38.27,0.0,0.0,30.5000,1.0,1.0,0.0,1.0
768,768.0,0.0,3.0,24.31,1.0,0.0,24.1500,0.0,1.0,1.0,0.0

4. [X] Create a function named `preprocess_titanic` that accepts the train, validate, and test titanic data, and returns the dataframes ready for modeling.

In [58]:
def preprocess_titanic(df):
    """
    Function to process and encode titanic dataset. 
    
    !!! WARNING !!! 
    This function will turn all columns into numerics for modeling. It is ill-advised to use this on your complete dataset.
    """
    # Encode sex column into binary is_male column
    df['is_male'] = pd.get_dummies(df.sex,drop_first=True).astype(int)
    
    # Encode embark_town into binary columns 'is_Queenstown' and 'is_Southampton'
    # Don't make column for Cherbourg because if Queenstown and Southampton are 0,
    # then Cherbourg must be 1
    df[['is_Queenstown','is_Southampton']] = pd.get_dummies(df.embark_town,drop_first=True).astype(int)
    
    # Drop columns that are not encoded
    df = df.drop(columns=['sex','embark_town'],errors='ignore')
    
    # Fill null values in age based on the mean age of a passenger's class
    df.age = df.age.fillna(round(df.groupby('pclass').age.transform('mean'),2))
    
    # Encode everything as numerics
    df = df.astype(float)
    
    return df

In [72]:
# Try out the function.
# Import the titanic dataset, run the prepare, and then the preprocess function
titanic = acquire.get_titanic_data()
titanic = prepare.prep_titanic(titanic)
train,validate,test = prepare.split_df(titanic,'survived')
train_encoded = preprocess_titanic(train)
train_encoded

Reading from file...

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone,is_male,is_Queenstown,is_Southampton
776,776.0,0.0,3.0,24.31,0.0,0.0,7.7500,1.0,1.0,1.0,0.0
829,829.0,1.0,1.0,62.00,0.0,0.0,80.0000,1.0,0.0,0.0,0.0
215,215.0,1.0,1.0,31.00,1.0,0.0,113.2750,0.0,0.0,0.0,0.0
258,258.0,1.0,1.0,35.00,0.0,0.0,512.3292,1.0,0.0,0.0,0.0
129,129.0,0.0,3.0,45.00,0.0,0.0,6.9750,1.0,1.0,0.0,1.0
...,...,...,...,...,...,...,...,...,...,...,...
125,125.0,1.0,3.0,12.00,1.0,0.0,11.2417,0.0,1.0,0.0,0.0
360,360.0,0.0,3.0,40.00,1.0,4.0,27.9000,0.0,1.0,0.0,1.0
55,55.0,1.0,1.0,38.27,0.0,0.0,35.5000,1.0,1.0,0.0,1.0
298,298.0,1.0,1.0,38.27,0.0,0.0,30.5000,1.0,1.0,0.0,1.0
768,768.0,0.0,3.0,24.31,1.0,0.0,24.1500,0.0,1.0,1.0,0.0

Using the Telco dataset

1. [ ] Use the function defined in `acquire.py` to load the Telco data.

2. [ ] Use the function defined in `prepare.py` to prepare the Telco data.

3. Encode the categorical columns on train.
    1. [ ] Encode at least one column using `.replace`
    2. [ ] Encode at least one column using `.map`
    3. [ ] Encode the rest of the columns by creating dummy variables and concatenating them onto the dataframe.

4. [ ] Repeat the same steps on validate and test.

5. [ ] Create a function named `prep_telco` that accepts the train, validate, and test telco data, and returns the dataframes ready for modeling.